# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Aula de Revisão da Parte #1}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* (#1) Código

- [X] Substituir o FOR pelo comando WHILE
- [X] substituir o WHILE pelo comando DO-WHILE

#+BEGIN_SRC C :results output :tangle e/simul-p1-q1-substituir.c
#include <stdio.h>
int main ()
{
  int x, i, j;
  x = 8;
  i = 2;
  while (i < 5){

    j= 3;
    do {
      x = x+1;
      j = j-1;
    }while(j > 0);
    printf( "X : %5d\n", x );
    i++;
  }
  printf("- Fim - \n");
  return 0;
}  
#+END_SRC

#+RESULTS:
: X :    11
: X :    14
: X :    17
: - Fim -

